//Условия в програмировании механизм принятия решений, который позволяет программе выполнять определенные действия в зависимости от условий. В JavaScript условия реализуются с помощью операторов if, else if и else.

let number1 = 5;
let number2 = 5;
let result = number1 === number2;
console.log(result) // true, потому что number1 и number2 равны


result = number1 == number2;
console.log(result)

console.log('5' === 5) // false, потому что типы данных разные (строка и число)
console.log('5' == 5) // true, потому что оператор == приводит типы данных к одному типу (строка и число приводятся к числу)

console.log('5' !== 5) // true, потому что типы данных разные (строка и число)
console.log('5' != 5) // false, потому что оператор != приводит типы данных к одному типу (строка и число приводятся к числу)

// какие типы сравнения бывают
// === строгое равенство (сравнивает и значение, и тип)
// == нестрогое равенство (сравнивает только значение, приводит типы)
// !== строгое неравенство (сравнивает и значение, и тип)
// != нестрогое неравенство (сравнивает только значение, приводит типы)
// > больше
// < меньше
// >= больше или равно даже если типы разные (например, строка и число)
// <= меньше или равно дажке если типы разные (например, строка и число)
// && логическое И (возвращает true, если оба условия истинны)
// || логическое ИЛИ (возвращает true, если хотя бы одно условие истинно)
// ! логическое НЕ (возвращает true, если условие ложно)

console.log([] == ![]); // true, потому что пустой массив приводится к false, а ![] - это true, поэтому сравнение становится false == true, что равно true
